In [1]:
import pandas as pd 
import numpy as np

In [9]:
df_train = pd.read_csv("tif_df_train.csv")
df_test = pd.read_csv("tif_df_test.csv")
df_org = pd.read_excel("output_data.xlsx")

In [10]:
df_train.head()

,Image_Name,Landmarks,Labels
0,A02F10-JTP-4281AN.jpg,"[[123, 487], [145, 476], [200, 465], [244, 465...",Angry
1,A02F10-JTP-4306AN-NE.jpg,"[[101, 492], [148, 463], [206, 454], [253, 463...",Angry
2,A06M5-JTPC-5177AN.jpg,"[[118, 498], [171, 453], [234, 436], [278, 436...",Angry
3,A08M12-JTPC-5437AN-SA.jpg,"[[122, 483], [162, 463], [211, 454], [261, 454...",Angry
4,A10F5-NONE-6242AN.jpg,"[[108, 474], [159, 453], [211, 432], [263, 432...",Angry

In [11]:
df_test.head()

,Image_Name,Landmarks,Labels
0,A11F12-JTPWCFB-6350AN.jpg,"[[36, 540], [47, 635], [68, 719], [78, 793], [...",Angry
1,A19F6-JTPC-8617AN.jpg,"[[73, 542], [85, 633], [85, 724], [96, 803], [...",Angry
2,A05F7-JTP-4964DI-SA.jpg,"[[5, 548], [24, 634], [44, 710], [72, 777], [1...",Disgust
3,A07M4-NONE-5320DI.jpg,"[[34, 615], [43, 685], [52, 756], [61, 809], [...",Disgust
4,A08M12-JTPC-5416DI.jpg,"[[57, 541], [66, 621], [75, 701], [93, 772], [...",Disgust

In [12]:
df_org.head()

,Unnamed: 0,File,Happy,Sad,Disgust,Anger,Fear,Surprise,Neutral,Other,Clarity,Unnamed: 11,Intensity,Unnamed: 13,Valence,Unnamed: 15,Respondents,Unnamed: 17,Emotion,Arousal-Valence Category
0,0,A02F10-JTP- 4231,0.91,0.00,0.00,0.00,0.00,0.08,0.01,0.00,0.739336,0.92,0.619835,0.91,0.867257,0.73,98,NaN,Happy,Pleasant High Arousal
1,1,A02F10-JTP-4317,0.96,0.00,0.00,0.00,0.00,0.04,0.00,0.00,1.000000,0.68,0.946281,0.61,1.000000,0.55,113,NaN,Happy,Pleasant High Arousal
2,2,A02F10-JTP-4346,0.00,0.57,0.04,0.14,0.21,0.01,0.00,0.02,0.483412,0.98,0.557851,0.81,0.200590,0.82,93,NaN,Sad,Unpleasant High Arousal
3,3,A02F10-JTP-4281,0.00,0.11,0.13,0.66,0.09,0.00,0.01,0.01,0.535545,1.02,0.648760,0.80,0.176991,1.05,119,NaN,Anger,Unpleasant High Arousal
4,4,A02F10-JTP-4276,0.00,0.04,0.07,0.18,0.01,0.00,0.70,NaN,0.189573,1.13,0.177686,1.08,0.421829,0.73,77,NaN,Neutral,Unpleasant Low Arousal

In [13]:
df_org[df_org['File'] == 'A11F12-JTPWCFB-6350']

,Unnamed: 0,File,Happy,Sad,Disgust,Anger,Fear,Surprise,Neutral,Other,Clarity,Unnamed: 11,Intensity,Unnamed: 13,Valence,Unnamed: 15,Respondents,Unnamed: 17,Emotion,Arousal-Valence Category
65,65,A11F12-JTPWCFB-6350,0.0,0.0,0.24,0.73,0.0,0.0,0.03,NaN,0.578199,1.12,0.665289,0.96,0.20944,1.05,63,NaN,Anger,Unpleasant High Arousal

In [16]:
df_train = pd.DataFrame({
    'Image_Name': ['A11F12-JTPWCFB-6350AN.jpg', 'A11F12-JTPWCFB-6360AN.jpg'],
    'Other_Column': [1, 2]
})

In [22]:
df_test = pd.DataFrame({
    'Image_Name': ['A11F12-JTPWCFB-6350AN.jpg', 'A11F12-JTPWCFB-6370AN.jpg'],
    'Other_Column': [3, 4]
})

In [23]:
df_org = pd.DataFrame({
    'File': ['A11F12-JTPWCFB-6350', 'A11F12-JTPWCFB-6360', 'A11F12-JTPWCFB-6370'],
    'Other_Org_Column': ['Info1', 'Info2', 'Info3']
})

In [24]:
import pandas as pd

def match_and_append(df_train, df_test, df_org):
    # Step 1: Extract the base part of the 'Image_Name' by removing suffix (everything after the last '-')
    df_train['Image_Name_base'] = df_train['Image_Name'].str.extract(r'([A-Za-z0-9-]+)-[^-]+\.jpg')[0]
    df_test['Image_Name_base'] = df_test['Image_Name'].str.extract(r'([A-Za-z0-9-]+)-[^-]+\.jpg')[0]
    
    # Step 2: Merge df_train with df_org based on the base filename
    df_train = df_train.merge(df_org, left_on='Image_Name_base', right_on='File', how='left')
    
    # Step 3: Merge df_test with df_org based on the base filename
    df_test = df_test.merge(df_org, left_on='Image_Name_base', right_on='File', how='left')

    # Step 4: Drop the 'Image_Name_base' column if it's no longer needed
    df_train.drop(columns=['Image_Name_base'], inplace=True)
    df_test.drop(columns=['Image_Name_base'], inplace=True)
    
    return df_train, df_test

# Example usage:
# Assuming you already have df_train, df_test, and df_org loaded
df_train, df_test = match_and_append(df_train, df_test, df_org)

In [25]:
df_train

,Image_Name,Other_Column,File_x,Other_Org_Column_x,File_y,Other_Org_Column_y
0,A11F12-JTPWCFB-6350AN.jpg,1,NaN,NaN,NaN,NaN
1,A11F12-JTPWCFB-6360AN.jpg,2,NaN,NaN,NaN,NaN

In [26]:
df_test

                  Image_Name  Other_Column File Other_Org_Column
0  A11F12-JTPWCFB-6350AN.jpg             3  NaN              NaN
1  A11F12-JTPWCFB-6370AN.jpg             4  NaN              NaN